/*---------------------------------------------------------
Coding:         ***
Create Date:    2017-01-10
Desc:           系统通用错误码定义
update History:
  date:  
  coding:
  desc:  
---------------------------------------------------------*/
var error_code_desc = {
			"-380" : "用户角色锁定",
			"-370" : "用户锁定",
			
			"-360" : "token错误",
			"-340" : "用户在其他地方登陆",
			"-320" : "不是授信设备",
			"-300" : "token过期",
			"-161" : "用户检查错误",
			"-164" : "未知token被拒绝",
			
			"-103" :"IP拒绝访问",
			"-104" :"致命的错误",
			"-105" :"WEB访问失败",
			"-106" :"安全级别服务错误",
			
			"-2147483648" :"未分配返回值",
			"-140" :"参数错误",
			"-280" :"应用程序不存在",
			"-160" :"访问被拒绝",
			"-162" :"超时间，请重新登录",
			"-180" :"签名错误",
			"-200" :"请求解析错误",
			"-220" :"接口已升级",
			"-100" :"服务端返回未知错误",
			"-101" :"网关服务内部错误",
			"-102" :"序列化失败",
			
			"-107" :"DUBBO服务未找到",
			"-108" :"DUBBO服务超时",
			"-120" :"mt参数服务端无法识别",
}