/*---------------------------------------------------------
Coding:         ***
Create Date:    2017-01-18
Desc:          	公司错误代码
update History:
  date:  
  coding:
  desc:  
---------------------------------------------------------*/
var company_code_desc = {
				"2001":"删除失败",
				"2002":"插入失败",
				"2003":"修改失败",
				"2004":"必填字段不能为空",
				"2005":"查询不存在",
				"2006":"参数错误",
				"2007":"信息已经存在",
				"2008":"存在下级信息",
				"2009":"系统执行sql或Java异常",
				"2010":"查询失败",
				"2011":"修改状态失败",
				"2012":"调用服务失败"
}