/*---------------------------------------------------------
Coding:         aaa
Create Date:    2017-01-12
Desc:           公积金管理前端错误码定义
update History:
  date:  
  coding:
  desc:  
---------------------------------------------------------*/
var hosf_code_desc = {

	"6001" : "必填字段不能为空",
	"6002" : "新增失败",
	"6003" : "查询不存在",
	"6004" : "修改失败",
	"6005" : "删除失败",
	"6006" : "参数错误",
	"6007" : "无数据结果返回",
	"6008" : "数据重复",
	"6009" : "查询失败",
	"6010" : "调用服务失败",
	"6011" : "条件查询失败",
	"6012" : "获取下级失败",
	"6013" : "复制失败"

}