/*---------------------------------------------------------
 Coding:         ***
 Create Date:    2017-01-10
 Desc:           用户中心前端错误码定义
 update History:
 date:
 coding:
 desc:
 ---------------------------------------------------------*/
var insurance_error_define = {
    "-100" :"未知错误",

    "1000":"用户名或密码错误",
    "1001":"",
    "1002":"用户不存在",
    "1003":"",
    "1004":"用户登录失败",
    "1005":"",
    "1006":"用户获取token失败",
    "1007":"参数错误",
    "1008":"用户编辑中",
    "1009":"用户已停用",
    "1010":"非授信设备",
    "1011":"非活跃设备",
    "1012":"会话已过期",
    "1013":"无效的IP地址",
    "1014":"新密码不能为空，或格式不正确",
    "1015":"两次密码不一致",
    "1016":"密码格式不正确",
    "1017":"未同意用户服务协议",
    "1018":"手机号码格式不正确",
    "1019":"邮箱格式不正确",

    "1020":"邮箱已经被使用",

    "1021":"手机号已被注册",

    "1022":"注册失败",

    "1023":"手机验证码已失效",

    "1024":"手机验证码错误",
    "1025":"图形验证码已失效",
    "1026":"图形验证码错误",
    "1027":"更新用户失败",
    "1028":"删除节点信息失败",
    "1029":"新增节点信息失败",
    "1030":"修改节点信息失败",
    "1031":"节点信息不存在",
    "1032":"新增用户信息信息失败",
    "1033":"修改用户信息信息失败",
    "1034":"删除用户信息失败"
}